
// 문제 설명
//2자리 이상의 정수 number가 주어집니다.
//주어진 코드는 이 수를 2자리씩 자른 뒤, 
//자른 수를 모두 더해서 그 합을 출력하는 코드입니다.
//코드가 올바르게 작동하도록 한 줄을 수정해 주세요.
//
//제한사항
//10 ≤ number ≤ 2, 000, 000, 000
//number의 자릿수는 2의 배수입니다.
//
//입출력 예
//입력 #1
//4859
//출력 #1
//107
//
//입력 #2
//29
//출력 #2
//29
//
//입출력 예 설명
//입출력 예 #1
//입력된 수를 2자리씩 나눠 합치면 다음과 같습니다.
//48 + 59 = 107
//
//입출력 예 #2
//입력된 수를 2자리씩 나눠 합치면 다음과 같습니다.
//29 = 29

//디버깅(Debugging) 문제 안내
//디버깅(Debugging)은 이미 완성된 코드에서 버그를 찾아 수정하는 문제 타입입니다.
//1줄만 수정하여 버그를 고치세요.
//2줄 이상 수정할 경우, 실행 결과에 에러 메시지가 표시됩니다.

#include <iostream>

using namespace std;

int main003(void) {
    int number;
    cin >> number;

    int answer = 0;

    while (number > 0) {
        answer += number % 100;
        number /= 100;
    }
    cout << answer << endl;
    return 0;
}
